src/Reports/РасчетДолжностыхОкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>РасчетДолжностыхОкладов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/InformationRegisters/ТарифныеСтавкиПервогоРазрядаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТарифныеСтавкиПервогоРазрядаОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Совершенствование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяСтавка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавокЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделениеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостоянияЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияТрудаИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРаботника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЕТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключитьИзПУ2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременныйПереводКлимовичи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРаботникаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ТарифныеСтавкиРаботниковОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТарифныеСтавкиРаботниковОрганизации</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентПоКонтракту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСПовышениемПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладСПовышениемВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МесячнаяТарифнаяСтавкаВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СостояниеРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостояниеРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРаботникаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРаботникаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыЗанятостиВОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыЗанятостиВОрганизации</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновноеМестоРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Совместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСовместительство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Reports/РасчетДолжностыхОкладов/Ext/ObjectModule.bsl
Перем мМакет, мНомер;
Перем ТарифСтарыйИтог, ТарифНовыйИтог;
Перем ТарифСтарыйПоПредпрИтог, ТарифновыйПоПредпрИтог;
Перем ТекПодр, ТЗ;

#Если Клиент Тогда

	
Процедура ВывестиСтрокиПодразделения(ВыборкаСтрокШтРасписания, ДокументРезультат)
  
	Пока ВыборкаСтрокШтРасписания.Следующий() Цикл 
		
		ВыборкаПодразделенийСледующегоУровня = ВыборкаСтрокШтРасписания.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		Если НЕ ЗначениеЗаполнено(ВыборкаСтрокШтРасписания.Сотрудник) Тогда
			Если (ЗначениеЗаполнено(ТекПодр)) и (ТекПодр <> ВыборкаСтрокШтРасписания.ПодразделениеОрганизации) Тогда
				ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Итого");
				ОбластьДетальныхЗаписей.Параметры.ТарифСтарыйИтог = ТарифСтарыйИтог;
				ОбластьДетальныхЗаписей.Параметры.ТарифНовыйИтог = ТарифНовыйИтог;								
				ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
				
				ТарифСтарыйИтог = 0;
				ТарифНовыйИтог = 0;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаСтрокШтРасписания.ПодразделениеОрганизации) Тогда
				ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
				ПодразделениеОрганизацииКод = СокрЛП(ВыборкаСтрокШтРасписания.ПодразделениеОрганизацииКод);
				ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = ПодразделениеОрганизацииКод;
				ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииНаименование = ВыборкаСтрокШтРасписания.ПодразделениеОрганизацииНаименование;				
				ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			КонецЕсли;

			мНомер = 0;
		Иначе
			мНомер = мНомер + 1;
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
			ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокШтРасписания.Сотрудник.Код;	
			ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокШтРасписания.СотрудникНаименование;				
			ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокШтРасписания.Должность;
			
			НайденнаяСтр = ТЗ.НайтиСтроки(Новый Структура("ПодразделениеОрганизации,Сотрудник,Должность", ВыборкаСтрокШтРасписания.ПодразделениеОрганизации,ВыборкаСтрокШтРасписания.Сотрудник,ВыборкаСтрокШтРасписания.Должность));
			ТС = 0;
			Если НайденнаяСтр.Количество() = 0 Тогда
			Иначе
				ТС = НайденнаяСтр[0].Ставка;
				ОбластьДетальныхЗаписей.Параметры.ТарифСтарый = ТС;									
			КонецЕсли;
			
			ОбластьДетальныхЗаписей.Параметры.КоэффициентЕТС = ВыборкаСтрокШтРасписания.КоэффициентЕТС;
			ОбластьДетальныхЗаписей.Параметры.ПроцентПоКонтракту = ВыборкаСтрокШтРасписания.ПроцентПоКонтракту;
			ОбластьДетальныхЗаписей.Параметры.ИтоговоеПовышениеПоИнструкции = ВыборкаСтрокШтРасписания.ИтоговоеПовышениеПоИнструкции;
			ОбластьДетальныхЗаписей.Параметры.ТехнологическийКоэф = ВыборкаСтрокШтРасписания.ПовышенныйКоэффициентЕТС;
			
			ПараметрыСтавки = РегистрыСведений.ТарифныеСтавкиПервогоРазрядаОрганизаций.ПолучитьПоследнее(ДатаАктуальности,
			Новый Структура("Организация, ТарифнаяСтавка", ВыборкаСтрокШтРасписания.ПодразделениеОрганизации.Владелец, ВыборкаСтрокШтРасписания.РазмерСтавки1Разряда));
			СтавкаПервого = ПараметрыСтавки.Размер;
			
			ОбластьДетальныхЗаписей.Параметры.СтавкаПервогоРазряда = СтавкаПервого;
			
			мТарифнаяСтавкаРазряд = ВыборкаСтрокШтРасписания.КоэффициентЕТС * СтавкаПервого;
			ОбластьДетальныхЗаписей.Параметры.ТарифНовый = ВыборкаСтрокШтРасписания.Ставка;
			
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			//подсчитываем итоги
			ТарифСтарыйИтог = ТарифСтарыйИтог + ТС;
			ТарифНовыйИтог = ТарифНовыйИтог + ВыборкаСтрокШтРасписания.Ставка;
			ТарифСтарыйПоПредпрИтог = ТарифСтарыйПоПредпрИтог + ТС;
			ТарифНовыйПоПредпрИтог = ТарифНовыйПоПредпрИтог + ВыборкаСтрокШтРасписания.Ставка;

			ТекПодр = ВыборкаСтрокШтРасписания.ПодразделениеОрганизации;
		КонецЕсли;
		ВывестиСтрокиПодразделения(ВыборкаПодразделенийСледующегоУровня, ДокументРезультат)
		
	КонецЦикла;//цикл по подразделениям текущего уровня 	
КонецПроцедуры
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//  Дописать - булево.  Истина - табличный документ дописывается формируемым отчетом, 
//                      Ложь - заполняется формируемым отчетом (с предварительной очистой 
//                      табличного документа)
//
Процедура СформироватьОтчет(ДокументРезультат, Дописать = Ложь) Экспорт
   ТарифСтарыйИтог = 0; ТарифНовыйИтог = 0; ТекПодр = ""; 
   ТарифСтарыйПоПредпрИтог = 0; ТарифНовыйПоПредпрИтог = 0;	
   
	ЗапросПред = Новый Запрос;
	ТекстЗапросаПред =
	"ВЫБРАТЬ
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &Период
	|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
	|		ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
	|	КОНЕЦ КАК ЗанимаемыхСтавок,
	|	РаботникиОрганизации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	РаботникиОрганизации.Должность КАК Должность,
	|	ТарифныеСтавкиРаботниковОрганизации.Ставка КАК Ставка,
	|	РаботникиОрганизации.Должность.Код,
	|	РаботникиОрганизации.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,					
	|	РаботникиОрганизации.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,
	|	РаботникиОрганизации.Сотрудник КАК СотрудникНаименование
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, (НЕ Временно)) КАК РаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиРаботниковОрганизации.СрезПоследних(&Период, ) КАК ТарифныеСтавкиРаботниковОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
	|				ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор КАК Ссылка
	|			ИЗ
	|				РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&Период, (НЕ временно)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
	|			ГДЕ
	|				ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Организация = &Организация
	|				И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчетаИзмерение = НЕОПРЕДЕЛЕНО) КАК ВидТС
	|			ПО ТарифныеСтавкиРаботниковОрганизации.Сотрудник = ВидТС.Сотрудник
	|		ПО РаботникиОрганизации.Сотрудник = ТарифныеСтавкиРаботниковОрганизации.Сотрудник
	|ГДЕ
	|	(НЕ РаботникиОрганизации.Сотрудник ЕСТЬ NULL )
	|	И РаботникиОрганизации.ПодразделениеОрганизации.Владелец = &Организация
	|	И ВЫБОР
	|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &Период
	|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
	|			ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
	|		КОНЕЦ <> 0
	|	И (НЕ РаботникиОрганизации.Сотрудник В
	|				(ВЫБРАТЬ
	|					СостояниеРаботниковОрганизаций.Сотрудник
	|				ИЗ
	|					РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
	|				ГДЕ
	|					СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком)
	|					И СостояниеРаботниковОрганизаций.ПериодЗавершения >= &Период))
	|	И РаботникиОрганизации.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)
	|
	|СГРУППИРОВАТЬ ПО
	|	РаботникиОрганизации.ПодразделениеОрганизации,
	|	РаботникиОрганизации.Должность,
	//|	РаботникиОрганизации.Сотрудник,
	|	ТарифныеСтавкиРаботниковОрганизации.Ставка,
	|	РаботникиОрганизации.ПодразделениеОрганизации.Код,			
	|	РаботникиОрганизации.ПодразделениеОрганизации.Наименование,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &Период
	|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
	|		ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
	|	КОНЕЦ,
	|	РаботникиОрганизации.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделениеОрганизацииКод,
	|	ПодразделениеОрганизацииНаименование,
	|	Должность,
	|	Сотрудник";

	ЗапросПред.УстановитьПараметр("Период",	ДатаАктуальности - 60*60*24);
	ЗапросПред.УстановитьПараметр("Организация",		Организация);   
	ЗапросПред.УстановитьПараметр("Подразделение",      Подразделение);
	
	Если Не Подразделение.Пустая() Тогда
		Если Не Подразделение.Родитель.Пустая() Тогда
			ТекстЗапросаПред = СтрЗаменить(ТекстЗапросапред,"ПодразделениеОрганизации.Владелец = &Организация","ПодразделениеОрганизации В (&Подразделение)")
		Иначе
			ТекстЗапросаПред = СтрЗаменить(ТекстЗапросапред,"ПодразделениеОрганизации.Владелец = &Организация","ПодразделениеОрганизации.Родитель В (&Подразделение)")		
		КонецЕсли;
	КонецЕсли;
	ЗапросПред.Текст = ТекстЗапросаПред;
	
	РезультатЗапроса = ЗапросПред.Выполнить();

	ТЗ = Новый ТаблицаЗначений;
	ТЗ = РезультатЗапроса.Выгрузить();
	                                      
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &Период
	|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
	|		ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
	|	КОНЕЦ КАК ЗанимаемыхСтавок,
	|	РаботникиОрганизации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	РаботникиОрганизации.Должность КАК Должность,
	|	РаботникиОрганизации.РазрядЕТС,
	|	РаботникиОрганизации.КоэффициентЕТС,
	|	РаботникиОрганизации.Категория,
	|	ТарифныеСтавкиРаботниковОрганизации.Ставка КАК Ставка,
	|	ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту,
	|	ТарифныеСтавкиРаботниковОрганизации.ТарифнаяСтавка КАК ТарифнаяСтавка,
	|	ТарифныеСтавкиРаботниковОрганизации.ТарифнаяСПовышениемПоИнструкции КАК ТарифнаяСПовышениемПоИнструкции,
	|	РаботникиОрганизации.Должность.Код,
	|	РаботникиОрганизации.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,					
	|	РаботникиОрганизации.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,
	|	РаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
	|	РаботникиОрганизации.ПовышенныйКоэффициентЕТС,
	|	РаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда КАК РазмерСтавки1Разряда,	
	|	РаботникиОрганизации.Сотрудник КАК СотрудникНаименование
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, (НЕ Временно)) КАК РаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавкиРаботниковОрганизации.СрезПоследних(&Период, ) КАК ТарифныеСтавкиРаботниковОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчета КАК ВидРасчета,
	|				ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
	|				ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Регистратор КАК Ссылка
	|			ИЗ
	|				РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&Период, (НЕ временно)) КАК ПлановыеНачисленияРаботниковОрганизацийСрезПоследних
	|			ГДЕ
	|				ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.Организация = &Организация
	|				И ПлановыеНачисленияРаботниковОрганизацийСрезПоследних.ВидРасчетаИзмерение = НЕОПРЕДЕЛЕНО) КАК ВидТС
	|			ПО ТарифныеСтавкиРаботниковОрганизации.Сотрудник = ВидТС.Сотрудник
	|		ПО РаботникиОрганизации.Сотрудник = ТарифныеСтавкиРаботниковОрганизации.Сотрудник
	|ГДЕ
	|	(НЕ РаботникиОрганизации.Сотрудник ЕСТЬ NULL )
	|	И РаботникиОрганизации.ПодразделениеОрганизации.Владелец = &Организация
	|	И ВЫБОР
	|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &Период
	|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
	|			ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
	|		КОНЕЦ <> 0
	|	И (НЕ РаботникиОрганизации.Сотрудник В
	|				(ВЫБРАТЬ
	|					СостояниеРаботниковОрганизаций.Сотрудник
	|				ИЗ
	|					РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизаций
	|				ГДЕ
	|					СостояниеРаботниковОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияРаботникаОрганизации.ОтпускПоУходуЗаРебенком)
	|					И СостояниеРаботниковОрганизаций.ПериодЗавершения >= &Период))
	|	И РаботникиОрганизации.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)
	|
	|СГРУППИРОВАТЬ ПО
	|	РаботникиОрганизации.ПодразделениеОрганизации,
	|	РаботникиОрганизации.Должность,
	|	РаботникиОрганизации.Сотрудник,
	|	РаботникиОрганизации.РазрядЕТС,
	|	РаботникиОрганизации.КоэффициентЕТС,
	|	РаботникиОрганизации.Категория,
	|	ТарифныеСтавкиРаботниковОрганизации.Ставка,
	|	ТарифныеСтавкиРаботниковОрганизации.ПроцентПоКонтракту,
	|	ТарифныеСтавкиРаботниковОрганизации.ТарифнаяСтавка,
	|	ТарифныеСтавкиРаботниковОрганизации.ТарифнаяСПовышениемПоИнструкции,
	|	РаботникиОрганизации.Должность.Код,
	|	РаботникиОрганизации.ПодразделениеОрганизации.Код,			
	|	РаботникиОрганизации.ПодразделениеОрганизации.Наименование,
	|	РаботникиОрганизации.ТарифнаяСтавкаПервогоРазряда,		
	|	РаботникиОрганизации.ИтоговоеПовышениеПоИнструкции,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &Период
	|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
	|		ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
	|	КОНЕЦ,
	|	РаботникиОрганизации.ПовышенныйКоэффициентЕТС,
	|	РаботникиОрганизации.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделениеОрганизацииКод,
	|	ПодразделениеОрганизацииНаименование,
	|	Должность,
	|	Сотрудник
	|ИТОГИ
	//|	СУММА(ЗанимаемыхСтавок),
	|	СУММА(Ставка),
	|	СУММА(ТарифнаяСтавка),
	|	СУММА(ТарифнаяСПовышениемПоИнструкции)
	|ПО
	|	ОБЩИЕ,
	|	ПодразделениеОрганизации ИЕРАРХИЯ";

	Запрос.УстановитьПараметр("Период",	ДатаАктуальности);
	Запрос.УстановитьПараметр("Организация",		Организация);   
	Запрос.УстановитьПараметр("Подразделение",      Подразделение);
	
	Если Не Подразделение.Пустая() Тогда
    	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ПодразделениеОрганизации.Владелец = &Организация","ПодразделениеОрганизации В ИЕРАРХИИ(&Подразделение)")
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДокументРезультат.Очистить();

	Область = мМакет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Организация = Организация;	
	Область.Параметры.Период = ПредставлениеПериода(НачалоМесяца(ДатаАктуальности), КонецМесяца(ДатаАктуальности), "ДФ=""ММММ.гггг""");
	ДокументРезультат.Вывести(Область);
					
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.ПолеСлева			 = 0;
	ДокументРезультат.ПолеСправа		 = 0;
		
	Область = мМакет.ПолучитьОбласть("Шапка");
	ДокументРезультат.Вывести(Область);
	
	ВыборкаИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	мНомер = 0;
	ВывестиСтрокиПодразделения(ВыборкаИтог, ДокументРезультат);
	
	Область = мМакет.ПолучитьОбласть("Итого");
	Область.Параметры.ТарифСтарыйИтог = ТарифСтарыйИтог;
	Область.Параметры.ТарифНовыйИтог = ТарифНовыйИтог;								
	ДокументРезультат.Вывести(Область);
	
	Область = мМакет.ПолучитьОбласть("ИтогоПоПредприятию");
	Область.Параметры.ТарифСтарыйПоПредпрИтог = ТарифСтарыйПоПредпрИтог;
	Область.Параметры.ТарифНовыйПоПредпрИтог = ТарифНовыйПоПредпрИтог;								
	ДокументРезультат.Вывести(Область);
	
КонецПроцедуры

мМакет = ПолучитьМакет("МакетРасчетДолжностныхОкладов");

#КонецЕсли
